## Production: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                     NAME                      |
|----------|-----------------------------------------------|
| recreate | `module.idp_ecs.aws_ecs_task_definition.this` |
| update   | `module.idp_ecs.aws_ecs_service.this`         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.idp_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:957818836222:service/auth/zitadel"
        name                               = "zitadel"
        tags                               = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:957818836222:task-definition/zitadel:50" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.idp_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:957818836222:task-definition/zitadel:50" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:957818836222:task-definition/zitadel" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/idp/zitadel:v3.43.1" -> "957818836222.dkr.ecr.ca-central-1.amazonaws.com/idp/zitadel:latest"
                    name                   = "zitadel"
                    # (11 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "zitadel" -> (known after apply)
      ~ revision                 = 50 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ tags_all                 = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/idp_database/rds/locals.tf line 14, in locals:
  14:   region        = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 2 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.idp_ecs.aws_service_discovery_service.this,
  on .terraform/modules/idp_ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.security_txt"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.idp"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs_xray"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_ssm"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.idp_user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]

31 tests, 19 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
